app/Services/ArticleService.php

select * from `articles` order by `created_at` desc
---
	public function findAll($ob = 'created_at', $dir = 'desc') {
		return Article::orderBy($ob, $dir)->get();