app/Services/ProfileCategoryService.php

select * from `quagga_partition` where `pro_id` = 9310
---
	public function findByProfileDB($pro_id) {
		$lpc = DB::table('quagga_partition')->select('pro_id', 'cat_id', 'par_abs');
		$lpc = $lpc->where('quagga_partition.pro_id', '=', $pro_id)->get();