app/Services/QuestionService.php

	private function findByCategoryImpl($cats, $lastid, $limit) {
		if ($cats == null || ($cats != null && sizeof($cats) == 0)) {
			return new Collection();
		}
		$ca = Utils::idArray($cats);

		$lqas = DB::table('quagga_question')->select('quagga_question.que_id as queid');
		for ($i = 0; $i < sizeof($ca); $i++) {
			$lqas = $lqas
			->join('categorizations as c'.$i, function ($join) use ($ca, $i) {
				$join->on('c'.$i.'.categorizable_id', '=', 'quagga_question.id')
				->where('c'.$i.'.categorizable_type', '=', 'App\Models\Question')
				->where('c'.$i.'.category_id', '=', $ca[$i]);
			});
		}
		if ($limit > 0) {
			$lqas = $lqas->where('quagga_question.que_id', '>', $lastid)->take($limit)->get();
		} else {
			$lqas = $lqas->get();
---
select `quagga_question`.`que_id` as `queid` from `quagga_question` inner join `categorizations` as `c0` on `c0`.`categorizable_id` = `quagga_question`.`que_id` and `c0`.`categorizable_type` = 'App\Models\Question' and `c0`.`category_id` = 1

	public function saveQuestion($qt, $qi, $ldqalt, $user) {
	    $que = new Question();
	    DB::transaction(function () use ($que, $qi, $qt, $ldqalt, $user) {
	        $maxQueId = DB::table('quagga_question')->max('que_id'); // should be > 10000
	        $que->que_id = $maxQueId + 1;
	        $que->owner()->associate($user);
	        $que->save();

	        $qtr = new QuestionTextResource();
	        $maxMedtxtId = DB::table('quagga_tekst')->max('med_id');
	        $qtr->med_id = $maxMedtxtId + 1;
	        $qtr->med_type = $qt->getMedType();
	        $qtr->tek_contents = $qt->getTekContents();
	        $qtr->save();

	        $qask = new QuestionAsked();
	        $qask->que_id = $que->que_id;
	        $qask->pop_id = 1;
	        $qask->med_id = $qtr->med_id;
	        $qask->med_type = $qtr->med_type;
	        $qask->save();

	        $qir = new QuestionImageResource();
	        $maxMedgrfId = DB::table('quagga_graphic')->max('med_id');
---
select max(`que_id`) as aggregate from `quagga_question`
select max(`med_id`) as aggregate from `quagga_tekst`
select max(`med_id`) as aggregate from `quagga_graphic`


	        foreach ($ldqalt as $dqalt) {
	            $qtr = new QuestionTextResource();
	            $maxMedtxtId = DB::table('quagga_tekst')->max('med_id');
---
select max(`med_id`) as aggregate from `quagga_tekst`

	            $qalt->save();
	        }

	        $catids = [1];
	        if ($catids != null) {
	            $this->saveCategorizations($que, $catids);
	        }
	    });
---
insert into `categorizations` (`category_id`, `categorizable_id`, `categorizable_type`) values (1, 1001, 'App\Models\Question')